# Superstore Sales Workflow Tutorial

This notebook walks through cleaning the Superstore dataset, designing a relational structure, creating an SQLite database, and running example SQL queries and visualizations.

In [13]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.ticker as mticker

## 1️) Load and Inspect the Dataset

In [39]:
# reading error codes + research is how you can learn if there is different encoding, as seen below
df = pd.read_csv('../data/Superstore.csv', encoding='ISO-8859-1')
df.head()
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

### Double check some datatypes, and for nulls and duplicates:

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   object
 3   Ship Date      9994 non-null   object
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

In [41]:
df.duplicated().sum()

np.int64(0)

In [42]:
df.isnull().sum()

Row ID           0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Postal Code      0
Region           0
Product ID       0
Category         0
Sub-Category     0
Product Name     0
Sales            0
Quantity         0
Discount         0
Profit           0
dtype: int64

This data is incredibly clean - we can see there are no null values and no duplicates. However, there are some dates that could be saved in a better format.

## 2) Data Cleaning

In [43]:
df['Order Date'] = pd.to_datetime(df['Order Date'], dayfirst=True)
df['Ship Date'] = pd.to_datetime(df['Ship Date'], dayfirst=True)

In [44]:
df.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [45]:
df.Segment.unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

In [46]:
df.rename(columns={"Segment":"customer_category"}, inplace=True)
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,customer_category,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2013-138688,2013-06-13,2013-06-17,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2012-108966,2012-10-11,2012-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2012-108966,2012-10-11,2012-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

With real data, it is very likely more cleaning and wrangling would be required.

## 3) Build Relational Tables

In [47]:
conn = sqlite3.connect('../data/superstore.db')

customers_df = df[['Customer ID','Customer Name','customer_category','City','State','Region', 'Postal Code']].drop_duplicates().rename(columns={
    'Customer ID':'customer_id',
    'Customer Name':'customer_name',
    'City':'city',
    'State':'state',
    'Region':'region',
    'Postal Code': 'zipcode'
})

products_df = df[['Product ID','Category','Sub-Category','Product Name']].drop_duplicates().rename(columns={
    'Product ID':'product_id',
    'Category':'category',
    'Sub-Category':'subcategory',
    'Product Name':'product_name'
})

orders_df = df[['Order ID','Order Date','Ship Date','Ship Mode','Customer ID']].drop_duplicates().rename(columns={
    'Order ID':'order_id',
    'Order Date':'order_date',
    'Ship Date':'ship_date',
    'Ship Mode':'ship_mode',
    'Customer ID':'customer_id'
})

order_details_df = df[['Order ID','Product ID','Sales','Quantity','Discount','Profit']].rename(columns={
    'Order ID':'order_id',
    'Product ID':'product_id'
})


customers_df.to_sql('customers', conn, index=False, if_exists='replace')
products_df.to_sql('products', conn, index=False, if_exists='replace')
orders_df.to_sql('orders', conn, index=False, if_exists='replace')
order_details_df.to_sql('order_details', conn, index=False, if_exists='replace')
conn.commit()

In [48]:
for name, df in [
    ('customers', customers_df),
    ("products", products_df),
    ("orders", orders_df),
    ("order_details", order_details_df)
]:
    df.to_csv(f'../data/{name}.csv')

## 4) Make Some Queries!

### Which customer segments bring in the most revenue and profit?

In [49]:
query1 = """ SELECT 
    c.customer_category,
    ROUND(SUM(od.sales), 2) AS total_sales,
    ROUND(SUM(od.profit), 2) AS total_profit
FROM order_details od
JOIN orders o ON od.order_id = o.order_id
JOIN customers c ON o.customer_id = c.customer_id
GROUP BY c.customer_category
ORDER BY total_sales DESC;
"""
result1 = pd.read_sql(query1, conn)
result1

  customer_category  total_sales  total_profit
0          Consumer   8380282.43     973085.86
1         Corporate   5044899.83     660287.69
2       Home Office   2964459.36     434344.01

### What are the top 10 customers by total sales?

In [50]:
query2 = """ SELECT
    c.customer_id,
    c.customer_name,
    ROUND(SUM(od.sales), 2) AS total_sales
FROM order_details od
JOIN orders o 
    ON od.order_id = o.order_id
JOIN customers c 
    ON o.customer_id = c.customer_id
GROUP BY c.customer_id, c.customer_name
ORDER BY total_sales DESC
LIMIT 10; """
result2 = pd.read_sql(query2, conn)
result2

  customer_id  customer_name  total_sales
0    KL-16645   Ken Lonsdale    155927.52
1    SE-20110   Sanjit Engle    134303.82
2    CL-12565    Clay Ludtke    130566.55
3    AB-10105  Adrian Barton    130262.14
4    SC-20095   Sanjit Chand    127281.01
5    SM-20320    Sean Miller    125215.25
6    EH-13765   Edward Hooks    123730.56
7    GT-14710      Greg Tran    118201.20
8    SV-20365    Seth Vernon    114709.50
9    JL-15835       John Lee    107799.15

### Which product categories and subcategories are the most profitable overall?

In [60]:
query3 = """
SELECT 
    p.category,
    p.subcategory,
    SUM(od.profit) AS total_profit
FROM order_details od
JOIN products p
    ON od.product_id = p.product_id
GROUP BY p.category, p.subcategory
ORDER BY total_profit DESC;
"""
result3 = pd.read_sql(query3, conn)
result3

           category  subcategory  total_profit
0        Technology      Copiers    55617.8249
1        Technology  Accessories    48359.0527
2        Technology       Phones    46936.1861
3   Office Supplies        Paper    36994.5335
4   Office Supplies      Binders    30373.2020
5         Furniture       Chairs    26707.6526
6   Office Supplies      Storage    21408.7032
7   Office Supplies   Appliances    18514.4928
8         Furniture  Furnishings    14569.5873
9   Office Supplies    Envelopes     6964.1767
10  Office Supplies          Art     6551.5650
11  Office Supplies       Labels     5546.2540
12       Technology     Machines     2502.6381
13  Office Supplies    Fasteners      949.5182
14  Office Supplies     Supplies    -1189.0995
15        Furniture    Bookcases    -3452.8696
16        Furniture       Tables   -17725.4811

### What is the average discount given per category?

In [62]:
query4 = """
SELECT 
    p.category,
    AVG(od.discount) AS avg_discount
FROM order_details od
JOIN products p
    ON od.product_id = p.product_id
GROUP BY p.category
ORDER BY avg_discount DESC;
"""
result4 = pd.read_sql(query4, conn)
result4

          category  avg_discount
0        Furniture      0.172514
1  Office Supplies      0.157000
2       Technology      0.132970

### Which states or regions contribute the most to total sales?

In [72]:
query5 = """
SELECT 
    c.region,
    SUM(od.sales) AS total_sales
FROM order_details od
JOIN orders o
    ON od.order_id = o.order_id
JOIN customers c
    ON o.customer_id = c.customer_id
GROUP BY c.region
ORDER BY total_sales DESC;
"""

result5 = pd.read_sql(query5, conn)
result5

    region   total_sales
0     West  5.306522e+06
1     East  4.522990e+06
2  Central  3.853692e+06
3    South  2.706438e+06

### How many orders were shipped late (where Ship Date > Order Date + 3 days)?

In [69]:
query6 = """
SELECT COUNT(*) AS late_orders
FROM orders
WHERE DATE(ship_date) > DATE(order_date, '+3 days');
"""

result6 = pd.read_sql(query6, conn)
result6

   late_orders
0         3391

### Which month or year had the highest total sales?

In [74]:
query7 = """
SELECT 
    c.customer_category,
    ROUND(AVG(julianday(o.ship_date) - julianday(o.order_date)), 2) AS avg_shipping_time
FROM orders o
JOIN customers c
    ON o.customer_id = c.customer_id
GROUP BY c.customer_category
ORDER BY avg_shipping_time ASC;
"""

result7 = pd.read_sql(query7, conn)
result7

  customer_category  avg_shipping_time
0          Consumer               3.95
1       Home Office               3.96
2         Corporate               4.01

### What are the most frequently ordered products?

In [76]:
query8 = """
SELECT 
    p.category,
    ROUND(AVG(od.profit / od.sales), 4) AS avg_profit_margin
FROM order_details od
JOIN products p
    ON od.product_id = p.product_id
GROUP BY p.category
ORDER BY avg_profit_margin DESC;
"""

result8 = pd.read_sql(query8, conn)
result8

          category  avg_profit_margin
0       Technology             0.1548
1  Office Supplies             0.1402
2        Furniture             0.0427

### Which customers placed more than 5 orders total?

In [77]:
query9 = """
SELECT 
    c.state,
    ROUND(SUM(od.sales), 2) AS total_sales
FROM order_details od
JOIN orders o
    ON od.order_id = o.order_id
JOIN customers c
    ON o.customer_id = c.customer_id
GROUP BY c.state
ORDER BY total_sales DESC;
"""

result9 = pd.read_sql(query9, conn)
result9

                   state  total_sales
0             California   3314837.69
1               New York   1859365.37
2                  Texas   1547925.76
3           Pennsylvania    886105.68
4             Washington    862298.69
5               Illinois    843352.76
6                   Ohio    707747.69
7                Florida    635637.78
8         North Carolina    437938.43
9               Michigan    432428.02
10              Virginia    403947.25
11               Arizona    332928.15
12             Tennessee    270626.18
13               Georgia    267895.57
14               Indiana    264912.84
15              Colorado    254680.96
16         Massachusetts    221929.34
17                Oregon    212442.50
18              Kentucky    205286.58
19            New Jersey    196939.35
20             Wisconsin    186075.75
21              Delaware    175340.88
22             Minnesota    168387.68
23               Alabama    143041.01
24              Maryland    131546.83
25           Connecticut    128414.01
26              Oklahoma    101223.06
27                  Utah    100292.29
28              Arkansas     95158.70
29          Rhode Island     92447.37
30                Nevada     90519.94
31        South Carolina     86100.77
32           Mississippi     85740.48
33              Missouri     83206.77
34             Louisiana     75064.77
35              Nebraska     70650.40
36            New Mexico     62484.33
37                  Iowa     59973.77
38         New Hampshire     59719.61
39                Kansas     58887.31
40                 Idaho     52983.87
41          South Dakota     30554.57
42               Montana     20600.37
43               Vermont     18368.44
44                 Maine     18239.70
45  District of Columbia     15420.31
46         West Virginia     11405.48
47          North Dakota      6113.26
48               Wyoming      2453.28

### What’s the profit margin (profit ÷ sales) by category or segment?

In [79]:
query10 = """
SELECT 
    c.city,
    ROUND(SUM(od.profit), 2) AS total_profit
FROM order_details od
JOIN orders o
    ON od.order_id = o.order_id
JOIN customers c
    ON o.customer_id = c.customer_id
GROUP BY c.city
ORDER BY total_profit DESC;
"""

result10 = pd.read_sql(query10, conn)
result10

                 city  total_profit
0       New York City     201947.64
1         Los Angeles     153562.13
2             Seattle     121758.04
3       San Francisco      95536.53
4             Houston      82422.09
..                ...           ...
526       Santa Maria      -2204.81
527          Florence      -3220.50
528  Colorado Springs      -3428.15
529            Pomona      -6014.09
530       Thomasville      -6576.67

[531 rows x 2 columns]

### 5) Visualize it!

From your ten results, select at least 4 to utilize in a meaningful visualization.

In [ ]:
# example using result1
plt.figure(figsize=(10,6))
colors = ["#a7adaa", "#a7adaa", "#f74141" ]
sns.barplot(result1, x='customer_category', y='total_sales', palette=colors, hue='customer_category', legend=False)
plt.title('Small Offices, Smaller Sales: The Home Office Gap',fontsize=18)
plt.xlabel(None)
plt.ylabel('Total Sales ($USD)')

#for those wondering how to get rid of scientific notation! Set style to plain:
plt.ticklabel_format(style='plain', axis='y')

#mticker is a great library for helping tick mark formatting, such as adding commas and dollar signs in this case
ax = plt.gca()
ax.yaxis.set_major_formatter(mticker.FuncFormatter(lambda x, _: f'${x:,.0f}'))

#using the seaborn library, despining is way easier!
sns.despine()
plt.show()

In [ ]:
# visualization one code here

In [ ]:
# visualization two code here

In [ ]:
# visualization three code here

In [ ]:
# visualization four code here